app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `user_id` = '3'
---
    function getUser($params){

        $data = $this->where($params)->findAll();

INSERT INTO `users` (`user_name`, `user_email`, `password`, `status`) VALUES ('test_user', 'test@test.hu', '$2y$10$v9ATFt8CF9Zdp.ydHwxn3O7zsvdL/ue4o6e/XYEBOagO1JbYJYim2', 1)
---
    function addUser($data){

        return $this->insert($data,true);